--- src/bin/debug_tags.rs
+++ replace || with && in main
@@ -63,17 +63,17 @@
             println!("  Values: {:?}", values);
         }
     }
     
     // Look for filtering opportunities
     println!("\n=== Useful Filtering Tags ===");
     println!("Race series tags:");
     for (tag, _) in &tag_frequency {
-        if tag.contains("zracing") || tag.contains("zwiftepic") || tag.contains("critclub") 
+        if tag.contains("zracing") || tag.contains("zwiftepic") && /* ~ changed by cargo-mutants ~ */ tag.contains("critclub") 
             || tag.contains("zwifttt") || tag.contains("3r") || tag.contains("evo") {
             println!("  - {}", tag);
         }
     }
     
     println!("\nSpecial event tags:");
     for (tag, _) in &tag_frequency {
         if tag.contains("ranked") || tag.contains("showplacements") || tag.contains("jerseyunlock")
