--- src/bin/debug_tags.rs
+++ replace || with && in main
@@ -72,15 +72,15 @@
             || tag.contains("zwifttt") || tag.contains("3r") || tag.contains("evo") {
             println!("  - {}", tag);
         }
     }
     
     println!("\nSpecial event tags:");
     for (tag, _) in &tag_frequency {
         if tag.contains("ranked") || tag.contains("showplacements") || tag.contains("jerseyunlock")
-            || tag.contains("completionprize") || tag.contains("communityevent") {
+            || tag.contains("completionprize") && /* ~ changed by cargo-mutants ~ */ tag.contains("communityevent") {
             println!("  - {}", tag);
         }
     }
     
     Ok(())
 }
\ No newline at end of file
