--- src/cache.rs
+++ delete ! in load_cached_stats
@@ -12,17 +12,17 @@
     fs::create_dir_all(&cache_dir)?;
     cache_dir.push("user_stats.json");
     Ok(cache_dir)
 }
 
 pub fn load_cached_stats() -> Result<Option<UserStats>> {
     let cache_file = get_cache_file()?;
 
-    if !cache_file.exists() {
+    if  /* ~ changed by cargo-mutants ~ */cache_file.exists() {
         return Ok(None);
     }
 
     let content = fs::read_to_string(cache_file)?;
     let cached: CachedStats = serde_json::from_str(&content)?;
 
     // Use cache if it's less than 24 hours old
     let age = Utc::now().signed_duration_since(cached.cached_at);
