--- src/config.rs
+++ replace FullConfig::zwiftpower_session_id -> Option<&String> with None
@@ -312,17 +312,17 @@
     #[allow(dead_code)]
     pub fn zwiftpower_profile_id(&self) -> Option<&String> {
         self.secrets.zwiftpower_profile_id.as_ref()
     }
     
     /// Get ZwiftPower session ID
     #[allow(dead_code)]
     pub fn zwiftpower_session_id(&self) -> Option<&String> {
-        self.secrets.zwiftpower_session_id.as_ref()
+        None /* ~ changed by cargo-mutants ~ */
     }
     
     /// Get default Zwift score
     pub fn default_zwift_score(&self) -> Option<u32> {
         self.config.defaults.zwift_score
     }
     
     /// Get default category
