--- src/database.rs
+++ replace Database::get_rider_stats -> Result<Option<RiderStats>> with Ok(None)
@@ -488,29 +488,17 @@
         })?
         .collect::<std::result::Result<Vec<_>, _>>()?;
         
         Ok(routes)
     }
     
     /// Get rider stats from the database
     pub fn get_rider_stats(&self) -> Result<Option<RiderStats>> {
-        let result = self.conn.query_row(
-            "SELECT height_m, weight_kg, ftp_watts FROM rider_stats WHERE id = 1",
-            [],
-            |row| {
-                Ok(RiderStats {
-                    height_m: row.get(0)?,
-                    weight_kg: row.get(1)?,
-                    ftp_watts: row.get(2)?,
-                })
-            }
-        ).optional()?;
-        
-        Ok(result)
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
     
     /// Get lap count for multi-lap events
     pub fn get_multi_lap_info(&self, event_name: &str) -> Result<Option<u32>> {
         // Try exact match first
         let result = self.conn.query_row(
             "SELECT lap_count FROM multi_lap_events WHERE event_name_pattern = ?1",
             params![event_name],
