--- src/database.rs
+++ replace get_database_path -> Result<PathBuf> with Ok(Default::default())
@@ -647,22 +647,17 @@
         })?
         .collect::<Result<Vec<_>, _>>()?;
         
         Ok(stats)
     }
 }
 
 fn get_database_path() -> Result<PathBuf> {
-    let mut data_dir = dirs::data_local_dir()
-        .unwrap_or_else(|| PathBuf::from("."));
-    data_dir.push("zwift-race-finder");
-    std::fs::create_dir_all(&data_dir)?;
-    data_dir.push("races.db");
-    Ok(data_dir)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use chrono::Utc;
     
     #[test]
