--- src/main.rs
+++ replace != with == in print_events_table
@@ -997,17 +997,17 @@
 fn print_events_table(events: &[ZwiftEvent], _args: &Args, zwift_score: u32) {
     if events.is_empty() {
         return;
     }
     
     // Check if events span multiple days
     let first_event_time: DateTime<Local> = events[0].event_start.into();
     let last_event_time: DateTime<Local> = events[events.len() - 1].event_start.into();
-    let spans_multiple_days = first_event_time.date_naive() != last_event_time.date_naive();
+    let spans_multiple_days = first_event_time.date_naive() == /* ~ changed by cargo-mutants ~ */ last_event_time.date_naive();
     
     // Collect data for all events
     let mut rows: Vec<(EventTableRow, DateTime<Local>)> = Vec::new();
     
     for event in events {
         let row = prepare_event_row(event, zwift_score);
         let local_time: DateTime<Local> = event.event_start.into();
         rows.push((row, local_time));
