--- src/main.rs
+++ delete match arm
@@ -122,17 +122,17 @@
         return Some(RouteData {
             distance_km: db_route.distance_km,
             elevation_m: db_route.elevation_m,
             name: &"",  // We don't use name in calculations
             world: &"",  // We don't use world in calculations
             surface: match db_route.surface.as_str() {
                 "road" => "road",
                 "gravel" => "gravel",
-                "mixed" => "mixed",
+                 /* ~ changed by cargo-mutants ~ */
                 _ => "road",
             },
             lead_in_distance_km: db_route.lead_in_distance_km,
         });
     }
     
     // Fallback to hardcoded data
     match route_id {
