--- src/main.rs
+++ delete ! in print_event
@@ -1413,17 +1413,17 @@
         }
     }
 
     if event.category_enforcement {
         println!("{}: {}", "Category".bright_blue(), "Enforced ✓".green());
     }
 
     // Show subgroups if any
-    if !event.event_sub_groups.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */event.event_sub_groups.is_empty() {
         println!("{}: ", "Categories".bright_blue());
         
         // Find the subgroup that matches user's category
         let user_category = get_category_from_score(zwift_score);
         
         for group in &event.event_sub_groups {
             let is_user_category = group.name.contains(user_category) || 
                                    (user_category == "D" && group.name.contains("E"));
