--- src/main.rs
+++ replace / with * in print_event
@@ -1435,17 +1435,17 @@
                 let dist_km = dist / 1000.0;
                 print!(" ({:.1} km", dist_km);
                 
                 // Try to calculate laps based on base route distance
                 if let Some(route_id) = event.route_id {
                     if let Some(route_data) = get_route_data(route_id) {
                         let base_distance = route_data.distance_km;
                         if base_distance > 0.0 {
-                            let laps = (dist_km / base_distance).round() as u32;
+                            let laps = (dist_km * /* ~ changed by cargo-mutants ~ */ base_distance).round() as u32;
                             if laps > 1 {
                                 print!(" - {} laps", laps);
                             }
                         }
                     }
                 }
                 print!(")");
                 
