--- src/main.rs
+++ delete match arm
@@ -160,24 +160,17 @@
             distance_km: 67.5,
             elevation_m: 654,
             name: "Makuri Pretzel",
             world: "Makuri Islands",
             surface: "road",
             lead_in_distance_km: 2.0,
         }),
         
-        3742187716 => Some(RouteData {
-            distance_km: 24.5,
-            elevation_m: 168,
-            name: "Castle to Castle",
-            world: "Makuri Islands",
-            surface: "road",
-            lead_in_distance_km: 2.0,
-        }),
+         /* ~ changed by cargo-mutants ~ */
         
         // Crit Racing Club routes
         2698009951 => Some(RouteData {
             distance_km: 22.9,
             elevation_m: 80,
             name: "Downtown Dolphin",
             world: "Crit City",
             surface: "road",
