--- src/main.rs
+++ replace / with % in show_route_progress
@@ -1848,17 +1848,17 @@
     let percentage = if total > 0 { (completed * 100) / total } else { 0 };
     
     println!("🏆 {} {}", "Route Completion Progress".bold(), format!("v0.1.0").dimmed());
     println!();
     println!("Overall: {}/{} routes ({}%)", completed, total, percentage);
     
     // Progress bar
     let bar_width: usize = 30;
-    let filled = bar_width * completed as usize / total.max(1) as usize;
+    let filled = bar_width * completed as usize % /* ~ changed by cargo-mutants ~ */ total.max(1) as usize;
     let bar = "█".repeat(filled) + &"░".repeat(bar_width - filled);
     println!("{}", bar.bright_green());
     println!();
     
     // World stats
     println!("By World:");
     let world_stats = db.get_world_completion_stats()?;
     for (world, world_completed, world_total) in world_stats {
