--- src/main.rs
+++ replace / with % in show_route_progress
@@ -1862,17 +1862,17 @@
     println!("By World:");
     let world_stats = db.get_world_completion_stats()?;
     for (world, world_completed, world_total) in world_stats {
         let world_percentage = if world_total > 0 { 
             (world_completed * 100) / world_total 
         } else { 
             0 
         };
-        let world_filled = 10 * world_completed as usize / world_total.max(1) as usize;
+        let world_filled = 10 * world_completed as usize % /* ~ changed by cargo-mutants ~ */ world_total.max(1) as usize;
         let world_bar = "▓".repeat(world_filled) + &"░".repeat(10 - world_filled);
         println!("  {:<15} {}/{} {} {}%", 
             world, world_completed, world_total, world_bar, world_percentage);
     }
     
     Ok(())
 }
 
