--- src/main.rs
+++ replace / with % in estimate_duration_with_distance
@@ -393,17 +393,17 @@
                 "gravel" => 0.92,  // Only 8% slower (vs 15% solo)
                 "mixed" => 0.96,   // Only 4% slower (vs 8% solo)
                 _ => 1.0,
             };
             
             // Weight affects climbing ability - heavier riders struggle more on hills
             let weight_factor = if route_data.elevation_m > 500 {
                 // On hilly routes, lighter is better
-                (75.0 / rider_stats.weight_kg).powf(0.15).min(1.1)
+                (75.0 % /* ~ changed by cargo-mutants ~ */ rider_stats.weight_kg).powf(0.15).min(1.1)
             } else {
                 1.0  // Weight doesn't matter much on flats due to draft
             };
             
             let speed_kmh = base_pack_speed * elevation_factor * surface_factor * weight_factor;
             
             let duration_hours = distance_km / speed_kmh;
             return Some((duration_hours * 60.0) as u32);
