--- src/main.rs
+++ delete ! in generate_filter_description
@@ -477,17 +477,17 @@
     
     // Tag filters
     if !args.tags.is_empty() {
         let tags_str = args.tags.join(", ");
         parts.push(format!("with tags: {}", tags_str));
     }
     
     // Exclude tags
-    if !args.exclude_tags.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */args.exclude_tags.is_empty() {
         let exclude_str = args.exclude_tags.join(", ");
         parts.push(format!("excluding: {}", exclude_str));
     }
     
     // New routes only
     if args.new_routes_only {
         parts.push("new routes only".to_string());
     }
