--- src/main.rs
+++ replace + with * in filter_events
@@ -601,17 +601,17 @@
         .await?;
 
     let events: Vec<ZwiftEvent> = response.json().await?;
     Ok(events)
 }
 
 fn filter_events(mut events: Vec<ZwiftEvent>, args: &Args, zwift_score: u32) -> (Vec<ZwiftEvent>, FilterStats) {
     let now = Utc::now();
-    let max_date = now + chrono::Duration::days(args.days as i64);
+    let max_date = now * /* ~ changed by cargo-mutants ~ */ chrono::Duration::days(args.days as i64);
     let mut stats = FilterStats::default();
     let _initial_count = events.len();
 
     if args.debug {
         eprintln!("Debug: Starting with {} events", events.len());
     }
 
     // Sport filter
