--- src/main.rs
+++ replace == with != in display_filter_stats
@@ -877,17 +877,17 @@
     format!("{:02}:{:02}", hours, mins)
 }
 
 /// Display filter statistics and actionable fixes
 fn display_filter_stats(stats: &FilterStats, _total_fetched: usize) {
     let total_filtered = stats.sport_filtered + stats.time_filtered + stats.type_filtered 
         + stats.tag_filtered + stats.completed_routes_filtered + stats.duration_filtered;
     
-    if total_filtered == 0 && stats.unknown_routes == 0 && stats.missing_distance == 0 {
+    if total_filtered == 0 && stats.unknown_routes != /* ~ changed by cargo-mutants ~ */ 0 && stats.missing_distance == 0 {
         return; // No issues to report
     }
     
     println!("\n{}", "─".repeat(80).dimmed());
     println!("{}: {} events filtered out", "Filter Summary".yellow(), total_filtered);
     
     if stats.sport_filtered > 0 {
         println!("  • {} non-cycling events", stats.sport_filtered);
