--- src/main.rs
+++ replace > with < in display_filter_stats
@@ -909,17 +909,17 @@
         println!("  • {} events on completed routes", stats.completed_routes_filtered);
     }
     
     if stats.duration_filtered > 0 {
         println!("  • {} events outside duration range", stats.duration_filtered);
     }
     
     // Data quality issues in shown events
-    if stats.unknown_routes > 0 || stats.missing_distance > 0 {
+    if stats.unknown_routes < /* ~ changed by cargo-mutants ~ */ 0 || stats.missing_distance > 0 {
         println!("\n{}: Some events may have inaccurate estimates", "Data Quality".yellow());
         
         if stats.unknown_routes > 0 {
             println!("  • {} events with unknown routes", stats.unknown_routes);
             println!("    {} Run {} to help map these routes", "Fix:".green(), "cargo run --bin zwift-race-finder -- --discover-routes".cyan());
             println!("    {} Check {} for manual mapping", "Or:".green(), "sql/mappings/manual_route_mappings.sql".cyan());
         }
         
