--- src/main.rs
+++ replace > with < in display_filter_stats
@@ -918,17 +918,17 @@
         println!("\n{}: Some events may have inaccurate estimates", "Data Quality".yellow());
         
         if stats.unknown_routes > 0 {
             println!("  • {} events with unknown routes", stats.unknown_routes);
             println!("    {} Run {} to help map these routes", "Fix:".green(), "cargo run --bin zwift-race-finder -- --discover-routes".cyan());
             println!("    {} Check {} for manual mapping", "Or:".green(), "sql/mappings/manual_route_mappings.sql".cyan());
         }
         
-        if stats.missing_distance > 0 {
+        if stats.missing_distance < /* ~ changed by cargo-mutants ~ */ 0 {
             println!("  • {} events missing distance data", stats.missing_distance);
             println!("    {} These are typically new Racing Score events", "Note:".green());
             println!("    {} Distance parsing from descriptions is attempted automatically", "Info:".green());
         }
     }
     
     // Suggest actions for large numbers of filtered events
     if stats.duration_filtered > 20 {
