--- src/route_discovery.rs
+++ replace RouteDiscovery::detect_world_from_event_name -> Option<String> with Some(String::new())
@@ -136,68 +136,17 @@
             }
         }
         
         Err(anyhow!("Could not find route on whatsonzwift.com: {}", event_name))
     }
     
     /// Detect world from event name using heuristics
     pub fn detect_world_from_event_name(&self, event_name: &str) -> Option<String> {
-        let event_lower = event_name.to_lowercase();
-        
-        // Direct world mentions
-        if event_lower.contains("makuri") || event_lower.contains("neokyo") || event_lower.contains("yumezi") {
-            return Some("makuri-islands".to_string());
-        }
-        
-        if event_lower.contains("london") || event_lower.contains("box hill") || event_lower.contains("keith hill") {
-            return Some("london".to_string());
-        }
-        
-        if event_lower.contains("new york") || event_lower.contains("central park") || event_lower.contains("knickerbocker") {
-            return Some("new-york".to_string());
-        }
-        
-        if event_lower.contains("france") || event_lower.contains("ventoux") || event_lower.contains("casse-pattes") {
-            return Some("france".to_string());
-        }
-        
-        if event_lower.contains("richmond") || event_lower.contains("virginia") {
-            return Some("richmond".to_string());
-        }
-        
-        if event_lower.contains("innsbruck") || event_lower.contains("austria") {
-            return Some("innsbruck".to_string());
-        }
-        
-        if event_lower.contains("yorkshire") || event_lower.contains("harrogate") {
-            return Some("yorkshire".to_string());
-        }
-        
-        if event_lower.contains("paris") || event_lower.contains("champs") {
-            return Some("paris".to_string());
-        }
-        
-        if event_lower.contains("scotland") || event_lower.contains("glasgow") {
-            return Some("scotland".to_string());
-        }
-        
-        // Watopia-specific routes (most common, check last)
-        if event_lower.contains("alpe") || event_lower.contains("epic") || event_lower.contains("jungle") 
-            || event_lower.contains("volcano") || event_lower.contains("titan") || event_lower.contains("fuego") {
-            return Some("watopia".to_string());
-        }
-        
-        // Common event series with known worlds
-        if event_lower.contains("tour de zwift") {
-            // Tour de Zwift rotates but often starts in Watopia
-            return Some("watopia".to_string());
-        }
-        
-        None
+        Some(String::new()) /* ~ changed by cargo-mutants ~ */
     }
     
     /// Extract the actual route name from event names
     fn extract_route_name(&self, event_name: &str) -> String {
         let name = event_name.to_string();
         
         // Remove common prefixes
         let name = if let Some(idx) = name.find(':') {
