--- src/route_discovery.rs
+++ replace || with && in RouteDiscovery::detect_world_from_event_name
@@ -163,17 +163,17 @@
         if event_lower.contains("richmond") || event_lower.contains("virginia") {
             return Some("richmond".to_string());
         }
         
         if event_lower.contains("innsbruck") || event_lower.contains("austria") {
             return Some("innsbruck".to_string());
         }
         
-        if event_lower.contains("yorkshire") || event_lower.contains("harrogate") {
+        if event_lower.contains("yorkshire") && /* ~ changed by cargo-mutants ~ */ event_lower.contains("harrogate") {
             return Some("yorkshire".to_string());
         }
         
         if event_lower.contains("paris") || event_lower.contains("champs") {
             return Some("paris".to_string());
         }
         
         if event_lower.contains("scotland") || event_lower.contains("glasgow") {
