--- src/route_discovery.rs
+++ replace || with && in RouteDiscovery::detect_world_from_event_name
@@ -171,17 +171,17 @@
         if event_lower.contains("yorkshire") || event_lower.contains("harrogate") {
             return Some("yorkshire".to_string());
         }
         
         if event_lower.contains("paris") || event_lower.contains("champs") {
             return Some("paris".to_string());
         }
         
-        if event_lower.contains("scotland") || event_lower.contains("glasgow") {
+        if event_lower.contains("scotland") && /* ~ changed by cargo-mutants ~ */ event_lower.contains("glasgow") {
             return Some("scotland".to_string());
         }
         
         // Watopia-specific routes (most common, check last)
         if event_lower.contains("alpe") || event_lower.contains("epic") || event_lower.contains("jungle") 
             || event_lower.contains("volcano") || event_lower.contains("titan") || event_lower.contains("fuego") {
             return Some("watopia".to_string());
         }
