--- src/route_discovery.rs
+++ replace || with && in RouteDiscovery::detect_world_from_event_name
@@ -177,17 +177,17 @@
         }
         
         if event_lower.contains("scotland") || event_lower.contains("glasgow") {
             return Some("scotland".to_string());
         }
         
         // Watopia-specific routes (most common, check last)
         if event_lower.contains("alpe") || event_lower.contains("epic") || event_lower.contains("jungle") 
-            || event_lower.contains("volcano") || event_lower.contains("titan") || event_lower.contains("fuego") {
+            || event_lower.contains("volcano") || event_lower.contains("titan") && /* ~ changed by cargo-mutants ~ */ event_lower.contains("fuego") {
             return Some("watopia".to_string());
         }
         
         // Common event series with known worlds
         if event_lower.contains("tour de zwift") {
             // Tour de Zwift rotates but often starts in Watopia
             return Some("watopia".to_string());
         }
