--- src/route_discovery.rs
+++ replace match guard with true
@@ -319,17 +319,17 @@
         
         // ZwiftInsider uses simple /route/ROUTE-NAME/ format
         let route_url = format!("https://zwiftinsider.com/route/{}/", route_slug);
         
         // Add small delay to be respectful
         tokio::time::sleep(Duration::from_millis(500)).await;
         
         match self.client.get(&route_url).send().await {
-            Ok(response) if response.status().is_success() => {
+            Ok(response) if true /* ~ changed by cargo-mutants ~ */ => {
                 let route_html = response.text().await?;
                 
                 // Check if this is actually a route page
                 if route_html.contains("Length") || route_html.contains("Distance") {
                     return self.parse_zwiftinsider_route(&route_html, event_name);
                 }
             }
             _ => {}
